tweetr_app_api/app/controllers/tweets_controller.rb

  def show
    tweet = Tweet.find(params[:id])
---
SELECT "tweets".* FROM "tweets" WHERE "tweets"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    tweet = Tweet.new(tweet_params)

    if tweet.save
---
INSERT INTO "tweets" ("title", "content", "author", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "test title"], ["content", "test content content content"], ["author", "zapfska"], ["created_at", "2021-01-16 01:28:24.128009"], ["updated_at", "2021-01-16 01:28:24.128009"]]

  def update
    tweet = Tweet.find(params[:id])
    tweet.update(tweet_params)
---
SELECT "tweets".* FROM "tweets" WHERE "tweets"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "tweets" SET "title" = $1, "content" = $2, "author" = $3, "updated_at" = $4 WHERE "tweets"."id" = $5  [["title", "replace null test values"], ["content", "replace null test values"], ["author", "zapfska"], ["updated_at", "2021-01-16 01:31:25.630228"], ["id", 4]]

  def destroy
    tweet = Tweet.destroy(params[:id])
---
DELETE FROM "tweets" WHERE "tweets"."id" = $1  [["id", 4]]